using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace AStep2021.CSharp.HW01
{
    class Program
    {
        static void Main(string[] args)
        {


        }
        static void Problem01()
        {
            /*1.	Даны целые положительные числа A, B, C. Значение
            этих чисел программа должна запрашивать у пользо-
            вателя. На прямоугольнике размера A*B размещено
            максимально возможное количество квадратов со
            стороной C. Квадраты не накладываются друг на
            друга. Найти количество квадратов, размещенных на
            прямоугольнике, а также площадь незанятой части
            прямоугольника.
            Необходимо предусмотреть служебные сообщения
            в случае, если в прямоугольнике нельзя разместить ни
            одного квадрата со стороной С (например, если зна-
            чение С превышает размер сторон прямоугольника).*/
        }



    }
}
